---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.BaseEquipmentConnector
zh: 系统
source: html/ba498d21-cdd8-ef07-e906-410443befc47.htm
---
# Autodesk.Revit.DB.MEPSystem.BaseEquipmentConnector Property

**中文**: 系统

The connector within base equipment which is used to connect with system.

## Syntax (C#)
```csharp
public Connector BaseEquipmentConnector { get; }
```

## Returns
Returns the connector which connects with the system within base equipment if base equipment has been assigned to system,
otherwise returns Nothing nullptr a null reference ( Nothing in Visual Basic) .